namespace SecTask.Models
{
    public class BMIDataAgeView
    {
        public static Dictionary< string, Dictionary<string, double> > dataView = new()
        {
            { "11-20", new Dictionary<string, double>
                {
                    {"Недостаточный вес", 0},
                    {"Нормальный вес", 0},
                    {"Избыточный вес", 0},
                    {"Ожирение", 0}
                }
            },
            { "21-30", new Dictionary<string, double>
                {
                    {"Недостаточный вес", 0},
                    {"Нормальный вес", 0},
                    {"Избыточный вес", 0},
                    {"Ожирение", 0}
                }
            },
            { "31-40", new Dictionary<string, double>
                {
                    {"Недостаточный вес", 0},
                    {"Нормальный вес", 0},
                    {"Избыточный вес", 0},
                    {"Ожирение", 0}
                }
            },
            { "41-50", new Dictionary<string, double>
                {
                    {"Недостаточный вес", 0},
                    {"Нормальный вес", 0},
                    {"Избыточный вес", 0},
                    {"Ожирение", 0}
                }
            },
            { "51-60", new Dictionary<string, double>
                {
                    {"Недостаточный вес", 0},
                    {"Нормальный вес", 0},
                    {"Избыточный вес", 0},
                    {"Ожирение", 0}
                }
            },
            { "61-70", new Dictionary<string, double>
                {
                    {"Недостаточный вес", 0},
                    {"Нормальный вес", 0},
                    {"Избыточный вес", 0},
                    {"Ожирение", 0}
                }
            },
            { "71-80", new Dictionary<string, double>
                {
                    {"Недостаточный вес", 0},
                    {"Нормальный вес", 0},
                    {"Избыточный вес", 0},
                    {"Ожирение", 0}
                }
            },
            { "81-90", new Dictionary<string, double>
                {
                    {"Недостаточный вес", 0},
                    {"Нормальный вес", 0},
                    {"Избыточный вес", 0},
                    {"Ожирение", 0}
                }
            },
            { "91-100", new Dictionary<string, double>
                {
                    {"Недостаточный вес", 0},
                    {"Нормальный вес", 0},
                    {"Избыточный вес", 0},
                    {"Ожирение", 0}
                }
            },
            { "101-110", new Dictionary<string, double>
                {
                    {"Недостаточный вес", 0},
                    {"Нормальный вес", 0},
                    {"Избыточный вес", 0},
                    {"Ожирение", 0}
                }
            },
            { "111-125", new Dictionary<string, double>
                {
                    {"Недостаточный вес", 0},
                    {"Нормальный вес", 0},
                    {"Избыточный вес", 0},
                    {"Ожирение", 0}
                }
            }
        };
    }
}
